In [2]:
import pandas as pd

In [6]:
business_results =pd.Series({'Arroz':4200,
                  'Papa':4800,
                  'Tomate' :5400,
                  'Salsa':2200,
                  'Leche' :2000,
                  'Huevo':300,
                  'Cebolla':400,
                  'Manzana':600,
                  'Pan': 3000,
                  'Arepa':800})
print(business_results)

Arroz      4200
Papa       4800
Tomate     5400
Salsa      2200
Leche      2000
Huevo       300
Cebolla     400
Manzana     600
Pan        3000
Arepa       800
dtype: int64

In [10]:
business_results_frame= pd.DataFrame({'Enero':[2000,1000,1200,8000,300],
                  'Febrero':[2300,1200,1300,600,9000],
                  'Marzo':[2400,1600,1400,4000,400],
                  'Abril':[1000,600,600,5000,3500],
                  'Mayo':[1000,4000,5000,6700,3000]},index=['Arroz','Papa','Tomate','Salsa','Leche'])
business_results_frame

        Enero  Febrero  Marzo  Abril  Mayo
Arroz    2000     2300   2400   1000  1000
Papa     1000     1200   1600    600  4000
Tomate   1200     1300   1400    600  5000
Salsa    8000      600   4000   5000  6700
Leche     300     9000    400   3500  3000

In [11]:
#Dictionary like
business_results_frame[['Febrero','Marzo']]

        Febrero  Marzo
Arroz      2300   2400
Papa       1200   1600
Tomate     1300   1400
Salsa       600   4000
Leche      9000    400

In [13]:
#Dictionary like
business_results_frame['Abril']

Arroz     1000
Papa       600
Tomate     600
Salsa     5000
Leche     3500
Name: Abril, dtype: int64